In [2]:
import pandas as pd

In [10]:
df = pd.read_csv('brand.csv' , na_values = ['??'])

In [8]:
df.columns

Index(['brand', 'type', 'cost', 'price', 'nn'], dtype='object')

In [5]:
type(df.iloc[:,0])

pandas.core.series.Series

In [11]:
df

  brand  type  cost  price  nn
0   br1  clnr    12     15 NaN
1   br2  util    23     34 NaN
2   br3   lux   189    191 NaN
3   br4  txtl   150    130 NaN

In [12]:
df.isnull().sum()

brand    0
type     0
cost     0
price    0
nn       4
dtype: int64

In [13]:
df['nn'].fillna(0,inplace = True)

In [14]:
df

  brand  type  cost  price   nn
0   br1  clnr    12     15  0.0
1   br2  util    23     34  0.0
2   br3   lux   189    191  0.0
3   br4  txtl   150    130  0.0